#Область ПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
    
    ЮТТесты
		.ДобавитьТест("СложениеБезПараметров",,"Позитив") 
		.ДобавитьТест("СложениеСПараметрами",,"Позитив")
            .СПараметрами(2, 3, 5)
            .СПараметрами(2, -3, -1)
            .СПараметрами("2", "-3", "2-3")
            .СПараметрами("2", -3, "2-3")
		;

КонецПроцедуры

Процедура СложениеБезПараметров() Экспорт

    РезультатСложения = 2 + 2; // 1
    ЮТест.ОжидаетЧто(РезультатСложения) // 2
        .Равно(4); // 3

КонецПроцедуры

Процедура СложениеСПараметрами(ПервыйОперанд, ВторойОперанд, Результат) Экспорт

    РезультатСложения = ПервыйОперанд + ВторойОперанд;
    ЮТест.ОжидаетЧто(РезультатСложения)
        .Равно(Результат);

КонецПроцедуры

#КонецОбласти
