#Область ПрограммныйИнтерфейс

// Обработка API ОписанияТоваров: Получить товар по артикулу
//
// Параметры:
//  Артикул	 - Строка
// 
// Возвращаемое значение:
//  СправочникСсылка.Товары
//
Функция ПолучитьТоварПоАртикулу(Артикул) Экспорт

	ТекстЗапроса = "ВЫБРАТЬ Ссылка 
	        | ИЗ Справочник.Товары 
			| ГДЕ Артикул = &Артикул";
			
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Артикул", Артикул);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка.ПолучитьОбъект();
	Иначе
		Возврат Неопределено;
	КонецЕсли;			

КонецФункции

#КонецОбласти
